app/controllers/comments_controller.rb

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "link_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Still need to fix some stuff but it`s coming along!\r\n"], ["link_id", 1], ["user_id", 4], ["created_at", "2017-01-31 00:30:39.468010"], ["updated_at", "2017-01-31 00:30:39.468010"]]
---
  def create
    @link = Link.find(params[:link_id])
    @comment = @link.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save