app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Check out my portfolio!"], ["url", "http://www.chuymedina.net"], ["created_at", "2017-01-23 00:31:03.414435"], ["updated_at", "2017-01-23 00:31:03.414435"]]
---
  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save

DELETE FROM "links" WHERE "links"."id" = ?  [["id", 2]]
---
  def destroy
    @link.destroy

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]
---
  def upvote
    @link = Link.find(params[:id])

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 6]]
---
  def downvote
    @link = Link.find(params[:id])